
#Область ОбработчикиСобытий
    
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    ПроверитьСоздатьНастройки(ПараметрКоманды);
    Отбор = Новый Массив;
    Отбор.Добавить(Новый Структура("УчетнаяСистема", ПараметрКоманды));
    КлючЗаписи = Новый("РегистрСведенийКлючЗаписи.НастройкиУчетныхСистем", Отбор);
    ПараметрыФормы = Новый Структура("Ключ, УчетнаяСистема", КлючЗаписи, ПараметрКоманды);
    ОткрытьФорму("РегистрСведений.НастройкиУчетныхСистем.ФормаЗаписи", ПараметрыФормы, 
        ПараметрыВыполненияКоманды.Источник, 
        ПараметрыВыполненияКоманды.Уникальность, 
        ПараметрыВыполненияКоманды.Окно, 
        ПараметрыВыполненияКоманды.НавигационнаяСсылка);
        
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
    
&НаСервере
Процедура ПроверитьСоздатьНастройки(УчетнаяСистема)
    
    МенеджерЗаписи = РегистрыСведений.НастройкиУчетныхСистем.СоздатьМенеджерЗаписи();
    МенеджерЗаписи.УчетнаяСистема = УчетнаяСистема;
    МенеджерЗаписи.Прочитать();
    Если Не МенеджерЗаписи.Выбран() Тогда
        МенеджерЗаписи.УчетнаяСистема = УчетнаяСистема;
        МенеджерЗаписи.Записать();
    КонецЕсли; 
    
КонецПроцедуры

#КонецОбласти 
