// @strict-types
#Область СлужебныйПрограммныйИнтерфейс
Процедура КомандаТестирование_ОжиданиеОткрытияОбработкиВА() Экспорт
	Попытка
		ФормаОбработкиВА = ВАИНТ_ТестированиеКлиент.ФормаОбработкиВА(); // См. Обработка.VanessaAutomationsingle.Форма.УправляемаяФорма
		Если ФормаОбработкиВА = Неопределено Тогда
			ОтключитьОбработчикОжидания("КомандаТестирование_ОжиданиеОткрытияОбработкиВА");
			Возврат;
		КонецЕсли;
		КоличествоПроверокОткрытияФормыВА = ВАИНТ_ТестированиеКлиент.КоличествоПроверокОткрытияФормыВА();
		МаксимальноеКоличествоПроверокОткрытияФормы = 10;
		ФормаВАОткрылась = ФормаОбработкиВА.ФормаVanessaAutomationОткрылась; // Булево -
		Если ФормаВАОткрылась Или КоличествоПроверокОткрытияФормыВА
			>= МаксимальноеКоличествоПроверокОткрытияФормы Тогда

			ОтключитьОбработчикОжидания("КомандаТестирование_ОжиданиеОткрытияОбработкиВА");
			Если ФормаВАОткрылась Тогда
				ВАИНТ_ТестированиеКлиент.ДополнитьПараметрыЗапускаКлиентов(ФормаОбработкиВА);
				ВАИНТ_ТестированиеКлиент.ЗаполнитьБиблиотекиШагов(ФормаОбработкиВА);
				ФормаОбработкиВА.ЗагрузитьФичи();
			КонецЕсли;
			ВАИНТ_ТестированиеКлиент.СброситьФормуОбработкиВА();
		Иначе
			КоличествоПроверокОткрытияФормыВА = КоличествоПроверокОткрытияФормыВА + 1;
			ВАИНТ_ТестированиеКлиент.УстановитьКоличествоПроверокОткрытияФормыВА(КоличествоПроверокОткрытияФормыВА);
		КонецЕсли;
	Исключение
		ОтключитьОбработчикОжидания("КомандаТестирование_ОжиданиеОткрытияОбработкиВА");
		ВАИНТ_ТестированиеКлиент.СброситьФормуОбработкиВА();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

#КонецОбласти