#Область ПрограммныйИнтерфейс

// Возвращает базовый каталог каталог тестов, заданный в настройках тестирования 
// 
// Возвращаемое значение:
// Строка, Неопределено - каталог тестов. Если не задан - возвращается Неопределено.
Функция БазовыйКаталогТестирования() Экспорт
	НастройкаПутьКТестам = ПредопределенноеЗначение("Перечисление.ВАИНТ_НастройкиТестирования.ПутьККаталогуТестов");
	БазовыйКаталогТестов = ВАИНТ_ТестированиеВызовСервера.ЗначениеНастройкиТестирования(НастройкаПутьКТестам); 
	Возврат БазовыйКаталогТестов;
КонецФункции
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Функция ИмяФайлаСозданияТестовыхДанных(ИмяЭлемента) Экспорт
	Возврат ИмяЭлемента + "РегрессионноеТестирование.feature";
КонецФункции

Функция ПутьКФайлуШаблонаФичи() Экспорт
	Возврат БазовыйКаталогТестирования() + "template.feature";
КонецФункции

Функция КаталогТестовПоТипуОбъекта(ТипОбъекта) Экспорт
	Если ТипОбъекта = "Справочник" Тогда
		Возврат БазовыйКаталогТестирования() + "Объекты\Справочники\";
	ИначеЕсли ТипОбъекта = "Документ" Тогда
		Возврат БазовыйКаталогТестирования() + "Объекты\Документы\";
	Иначе
		Возврат БазовыйКаталогТестирования() + ТипОбъекта + "\";
	КонецЕсли;
КонецФункции

Функция КаталогТестовОбъекта(ТипОбъекта, ИмяОбъекта) Экспорт
	КаталогТестовПоТипу = КаталогТестовПоТипуОбъекта(ТипОбъекта);
	Возврат КаталогТестовПоТипу + ИмяОбъекта;
КонецФункции

Функция ФайлСозданияТестовыхДанных(ТипОбъекта, ИмяОбъекта) Экспорт
	КаталогТестов = КаталогТестовОбъекта(ТипОбъекта, ИмяОбъекта);
	ИмяФайла = ИмяФайлаСозданияТестовыхДанных(ИмяОбъекта);
	Возврат КаталогТестов + "\" + ИмяФайла; 
КонецФункции

Функция ФайлТекущихПриемочныхТестов() Экспорт
	Возврат БазовыйКаталогТестирования() + "ПриемочныеТекущие.feature"; 
КонецФункции
#КонецОбласти
