///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОписаниеТипов = Параметры.ОписаниеТипов;
	ОбъектМетаданных = Параметры.ОбъектМетаданных;
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ОбъектМетаданных);
	
	Если МетаданныеОбъекта = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Элементы.ОписаниеТипов.ДоступныеТипы = Новый ОписаниеТипов(МетаданныеОбъекта.Тип);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ОписаниеТипов);
	
КонецПроцедуры

#КонецОбласти
