// @strict-types
#Область ПрограммныйИнтерфейс

// Возвращает указанную настройку тестирования.
// 
// Параметры:
// 	НастройкаТестирования - ПеречислениеСсылка.ВАИНТ_НастройкиТестирования - настройка, значение которой требуется вернуть.
// Возвращаемое значение:
// 	Произвольный - Значение настройки. Если настройка не задана возвращается Неопределено.
Функция ЗначениеНастройкиТестирования(НастройкаТестирования) Экспорт
	Запись = РегистрыСведений.ВАИНТ_НастройкиТестирования.СоздатьМенеджерЗаписи();
	Запись.НастройкаТестирования = НастройкаТестирования;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.ЗначениеНастройки;
	Иначе
		СообщениеПользователю = "Значение настройки " + НастройкаТестирования + " не задано."; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю);
	КонецЕсли;
КонецФункции

// Удалить объекты, созданные при тестировании.
Процедура УдалитьОбъектыСозданныеПриТестировании() Экспорт
	ВАИНТ_ТестированиеСервер.УдалитьОбъектыСозданныеПриТестировании();
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Описание элемента тестирования.
// 
// Параметры:
//  ИмяФормы - Строка - Имя формы
// 
// Возвращаемое значение:
//  Структура - Описание элемента тестирования:
// * ТипВладельца - Строка -
// * ИмяВладельца - Строка -
// * Формы - Массив -
Функция ОписаниеЭлементаТестирования(ИмяФормы) Экспорт
	Возврат ВАИНТ_ТестированиеСервер.ОписаниеОбъектаПоИмениФормы(ИмяФормы);
КонецФункции
#КонецОбласти