#Область ПрограммныйИнтерфейс

// Возвращает указанную настройку тестирования.
// 
// Параметры:
// 	НастройкаТестирования - ПеречислениеСсылка.ВАИНТ_НастройкиТестирования - настройка, значение которой требуется вернуть.
// Возвращаемое значение:
// 	Произвольный - Значение настройки. Если настройка не задана возвращается Неопределено.
Функция ЗначениеНастройкиТестирования(НастройкаТестирования) Экспорт
	Запись = РегистрыСведений.ВАИНТ_НастройкиТестирования.СоздатьМенеджерЗаписи();
	Запись.НастройкаТестирования = НастройкаТестирования;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.ЗначениеНастройки;
	Иначе
		СообщениеПользователю = "Значение настройки " + НастройкаТестирования + " не задано."; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеПользователю);
	КонецЕсли;
КонецФункции
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Функция ОписаниеЭлементаТестирования(ИмяФормы) Экспорт
	Возврат ВАИНТ_ТестированиеСервер.ОписаниеОбъектаПоИмениФормы(ИмяФормы);
КонецФункции
#КонецОбласти