#Область СлужебныйПрограммныйИнтерфейс
Функция ОписаниеОбъектаПоИмениФормы(ИмяФормы) Экспорт
	КонечнаяПозиция = СтрНайти(ИмяФормы, ".Форма.");
	ИмяВладельца = Лев(ИмяФормы, КонечнаяПозиция-1);
	КонечнаяПозиция = СтрНайти(ИмяФормы, ".");
	ТипОбъекта = Лев(ИмяФормы, КонечнаяПозиция-1);
	ОбъектВладелец = Метаданные.НайтиПоПолномуИмени(ИмяВладельца);
	Результат = Новый Структура("ТипВладельца, ИмяВладельца, Формы",ТипОбъекта, ОбъектВладелец.Имя, Новый Массив);

	Для Каждого ФормаЭлемента Из ОбъектВладелец.Формы Цикл
		Результат.Формы.Добавить(ФормаЭлемента.Имя);
	КонецЦикла;
	Возврат Результат;
КонецФункции
#КонецОбласти

