
#Область ПрограммныйИнтерфейс

// Выбирает справочник для добавляемого задания очереди заданий.
//
// Параметры:
//	ПараметрыЗадания - Структура - Параметры добавляемого задания, возможные ключи:
//	 * ОбластьДанных - Число - область данных
//	 * Использование - Булево - факт использования
//	 * ЗапланированныйМоментЗапуска - Дата - дата начала запуска
//	 * ЭксклюзивноеВыполнение - Булево - факт эксклюзивного выполнения
//	 * ИмяМетода - Строка - имя метода для задания (обязательно для указания.)
//	 * Параметры - Массив - массив параметров задания
//	 * Ключ - Строка - ключ задания
//	 * ИнтервалПовтораПриАварийномЗавершении - Число - указывается в секундах
//	 * Расписание - Расписания - расписания выполнения задания
//	 * КоличествоПовторовПриАварийномЗавершении - Число - количество повторов
//
Функция ПриВыбореСправочникаДляЗадания(Знач ПараметрыЗадания) Экспорт
	
	Если ПараметрыЗадания.Свойство("ОбластьДанных") И ПараметрыЗадания.ОбластьДанных <> -1 Тогда
		
		Возврат Справочники.ОчередьЗаданийОбластейДанных;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
