////////////////////////////////////////////////////////////////////////////////
// Подсистема "Электронная подпись в модели сервиса".
//  
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

Процедура ПриВключенииСервисаКриптографии() Экспорт
	
	
КонецПроцедуры

Функция ДолговременныйТокенИспользованиеВозможно(СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Истина;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

