////////////////////////////////////////////////////////////////////////////////
// Подсистема "Информационный центр".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Определяет ссылку поиска информации.
// Например сайт ИТС.
// Структура должна быть следующая:
//	Если к адресу ссылки добавить строку поиска, и перейти по данному адресу, то
//	в результате мы должны перейти форму результатов поиска.
//
// Параметры:
//	СсылкаПоискаИнформации - Строка - адрес.
//
Процедура ОпределитьСсылкуПоискаИнформации(СсылкаПоискаИнформации) Экспорт
	
КонецПроцедуры

// Определяет общие макеты с информационными ссылками.
//
// Параметры:
//  МассивМакетов - Массив - массив общих макетов.
//
Процедура ОбщиеМакетыСИнформационнымиСсылками(МассивМакетов) Экспорт
		
КонецПроцедуры

// Определяет массив полных путей к формам, в которых используются информационные ссылки.
//
// Параметры:
//  МассивФорм - Массив - массив полных путей к формам.
//
Процедура ФормыСИнформационнымиСсылками(МассивФорм) Экспорт
		
КонецПроцедуры

#КонецОбласти