#Область ОбработчикиСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем НастройкаТестирования;
	Если Параметры.Свойство("НастройкаТестирования", НастройкаТестирования) Тогда
		ЗаписьОбъект = РеквизитФормыВЗначение("Запись");
		ЗаписьОбъект.НастройкаТестирования = НастройкаТестирования;
		ЗаписьОбъект.Прочитать();
		Если Не  ЗаписьОбъект.Выбран() Тогда
			ЗаписьОбъект.НастройкаТестирования = НастройкаТестирования;
		КонецЕсли;
		ЗначениеВРеквизитФормы(ЗаписьОбъект, "Запись");
		Элементы.НастройкаТестирования.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти



#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗначениеНастройкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИсходныйКаталог = Запись.ЗначениеНастройки;
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Каталог = ИсходныйКаталог;
	Если ДиалогВыбора.Выбрать() Тогда
		Запись.ЗначениеНастройки = ДиалогВыбора.Каталог;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти