
#Область ПрограммныйИнтерфейс

#Область КодыВозврата

// Возвращает код ошибки данных.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода. 
//
Функция КодВозвратаОшибкаДанных() Экспорт
	
	Возврат 10400;
    
КонецФункции

// Возвращает код отказа авторизации.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода. 
//
Функция КодВозвратаОтказАвторизации() Экспорт
	
	Возврат 10403;
    
КонецФункции

// Возвращает код внутренней ошибки.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода. 
//
Функция КодВозвратаВнутренняяОшибка() Экспорт
	
	Возврат 10500;
    
КонецФункции

//  Возвращает код выполнения с предупреждениями.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода. 
//
Функция КодВозвратаВыполненоСПредупреждениями() Экспорт
	
	Возврат 10240;
    
КонецФункции
    
// Возвращает код успешного выполнения.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода. 
//
Функция КодВозвратаВыполнено() Экспорт
	
	Возврат 10200;
	
КонецФункции

// Возвращает код отсутствия данных.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода. 
//
Функция КодВозвратаНеНайдено() Экспорт
	
	Возврат 10404;
	
КонецФункции

#КонецОбласти 

#Область ТипыФайлов

// Возвращает строку с типом файла JSON
// 
// Возвращаемое значение:
//  Строка  - "json"
//
Функция ТипJSON() Экспорт
	
	Возврат "json";
	
КонецФункции

// Возвращает строку с типом файла XLSX
// 
// Возвращаемое значение:
//  Строка - "xlsx"
//
Функция ТипXLSX() Экспорт
	
	Возврат "xlsx";
	
КонецФункции

// Возвращает строку с типом файла PDF
// 
// Возвращаемое значение:
//  Строка - "pdf" 
//
Функция ТипPDF() Экспорт
	
	Возврат "pdf";
	
КонецФункции
    
#КонецОбласти 

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗапросСписок() Экспорт
	
	Возврат "list";
	
КонецФункции

Функция ПолеРезультат() Экспорт
	
	Возврат "result";
	
КонецФункции
 
Функция ПолеФайл() Экспорт
	
    Возврат "file";	
	
КонецФункции

Функция ПолеВерсия() Экспорт
	
    Возврат "version";	
	
КонецФункции

Функция ПолеОбработчик() Экспорт
	
    Возврат "handler";	
	
КонецФункции

Функция ПолеКодВозврата() Экспорт
	
	Возврат "response";
	
КонецФункции

Функция ПолеОшибка() Экспорт
	
	Возврат "error";
	
КонецФункции

Функция ПолеСообщениеОбОшибке() Экспорт
	
	Возврат "message";
	
КонецФункции

Функция ПолеХранилище() Экспорт
	
	Возврат "storage";
	
КонецФункции

Функция ПолеИдентификатор() Экспорт
	
	Возврат "id";
	
КонецФункции

Функция ПолеОсновнойРаздел() Экспорт
	
	Возврат "general";
	
КонецФункции

#КонецОбласти 
