
&После("ПриОпределенииКомандПодключенныхКОбъекту")
Процедура ВАИНТ_ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
		Если Пользователи.ЭтоПолноправныйПользователь() Тогда
			Команда = Команды.Добавить();
			Команда.Вид = "Тестирование";
			Команда.Представление = НСтр("ru = 'Регрессионное тестирование'");
			Команда.РежимЗаписи = "НеЗаписывать";
			Команда.ВидимостьВФормах = "ФормаДокумента,ФормаЭлемента,ФормаСписка";
			Команда.Обработчик = "ВАИНТ_ТестированиеКлиент.РегрессионныйТест";
		КонецЕсли;

КонецПроцедуры
&После("ПриОпределенииВидовПодключаемыхКоманд")
Процедура ВАИНТ_ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	Вид = ВидыПодключаемыхКоманд.Добавить();
	Вид.Имя         = "Тестирование";
	Вид.ИмяПодменю  = "ПодменюТестирование";
	Вид.Заголовок   = НСтр("ru = 'Тестирование'");
	Вид.Картинка    = БиблиотекаКартинок.Информация;
	Вид.Отображение = ОтображениеКнопки.КартинкаИТекст;

КонецПроцедуры

