
&После("ПриОпределенииКомандПодключенныхКОбъекту")
Процедура ВАИНТ_ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
		Если Пользователи.ЭтоПолноправныйПользователь() Тогда
			Команда = Команды.Добавить();
			Команда.Вид = "Тестирование";
			Команда.Представление = НСтр("ru = 'Регрессионное тестирование'");
			Команда.РежимЗаписи = "НеЗаписывать";
			Команда.ВидимостьВФормах = "ФормаДокумента,ФормаЭлемента,ФормаСписка";
			Команда.Обработчик = "ВАИНТ_ТестированиеКлиент.СозданиеТестовыхДанных";
		КонецЕсли;

КонецПроцедуры
