// @strict-types

#Область ПрограммныйИнтерфейс

// См. ОбщегоНазначенияКлиентПереопределяемый.ПриНачалеРаботыСистемы
// @skip-warning ПустойМетод - особенность реализации.
// 
// Параметры:
//	Параметры - см. ОбщегоНазначенияКлиентПереопределяемый.ПриНачалеРаботыСистемы.Параметры
//
Процедура ПриНачалеРаботыСистемы(Параметры) Экспорт
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Открывает каталог расширений.
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ОткрытьКаталогРасширений() Экспорт 
КонецПроцедуры

#КонецОбласти
