#Область СлужебныйПрограммныйИнтерфейс

Процедура МенеджерыЛогическихХранилищ(ВсеМенеджерыЛогическихХранилищ) Экспорт
    
    Если ИнтеграцияПодсистемБТС.ПодсистемаСуществует("ТехнологияСервиса.ПоставляемыеДанныеАбонентов") Тогда
        МодульПоставляемыеДанныеАбонентов = ИнтеграцияПодсистемБТС.ОбщийМодуль("ПоставляемыеДанныеАбонентов");
		ВсеМенеджерыЛогическихХранилищ.Вставить("supplied_data", МодульПоставляемыеДанныеАбонентов);
    КонецЕсли; 
    
    Если ИнтеграцияПодсистемБТС.ПодсистемаСуществует("ТехнологияСервиса.ОчередьЗаданийВнешнийИнтерфейс") Тогда
        МодульОчередьЗаданийВнешнийИнтерфейс = ИнтеграцияПодсистемБТС.ОбщийМодуль("ОчередьЗаданийВнешнийИнтерфейс");
        ИдентификаторХранилища = МодульОчередьЗаданийВнешнийИнтерфейс.ИдентификаторХранилища();
		ВсеМенеджерыЛогическихХранилищ.Вставить(ИдентификаторХранилища, МодульОчередьЗаданийВнешнийИнтерфейс);
    КонецЕсли; 
    
    Если ИнтеграцияПодсистемБТС.ПодсистемаСуществует("ТехнологияСервиса.ФайлыОбластейДанных") Тогда
        МодульФайлыОбластейДанных = ИнтеграцияПодсистемБТС.ОбщийМодуль("ФайлыОбластейДанных");
        ИдентификаторХранилища = МодульФайлыОбластейДанных.ИдентификаторХранилища();
		ВсеМенеджерыЛогическихХранилищ.Вставить(ИдентификаторХранилища, МодульФайлыОбластейДанных);
    КонецЕсли; 
    
    Если ИнтеграцияПодсистемБТС.ПодсистемаСуществует("ТехнологияСервиса.ИнтеграцияОбъектовОбластейДанных") Тогда
        МодульИнтеграцияОбъектовОбластейДанных = ИнтеграцияПодсистемБТС.ОбщийМодуль("ИнтеграцияОбъектовОбластейДанных");
        ИдентификаторХранилища = МодульИнтеграцияОбъектовОбластейДанных.ИдентификаторХранилища();
		ВсеМенеджерыЛогическихХранилищ.Вставить(ИдентификаторХранилища, МодульИнтеграцияОбъектовОбластейДанных);
    КонецЕсли;
	
	Если ИнтеграцияПодсистемБТС.ПодсистемаСуществует("ТехнологияСервиса.МиграцияПриложений") Тогда
        МодульМиграцияПриложений = ИнтеграцияПодсистемБТС.ОбщийМодуль("МиграцияПриложений");
		ВсеМенеджерыЛогическихХранилищ.Вставить("migration", МодульМиграцияПриложений);
    КонецЕсли;
    
    Если ИнтеграцияПодсистемБТС.ПодсистемаСуществует("ТехнологияСервиса.АсинхронноеПолучениеДанных") Тогда
        МодульАсинхронноеПолучениеДанных = ИнтеграцияПодсистемБТС.ОбщийМодуль("АсинхронноеПолучениеДанных");
        ИдентификаторХранилища = МодульАсинхронноеПолучениеДанных.ИдентификаторХранилища();
        ВсеМенеджерыЛогическихХранилищ.Вставить(ИдентификаторХранилища, МодульАсинхронноеПолучениеДанных);
    КонецЕсли;     
    
КонецПроцедуры

Процедура МенеджерыФизическихХранилищ(ВсеМенеджерыФизическихХранилищ) Экспорт
	
КонецПроцедуры

Процедура ПериодДействияВременногоИдентификатора(ПериодДействияВременногоИдентификатора) Экспорт
	
КонецПроцедуры

Процедура РазмерБлокаПолученияДанных(РазмерБлокаПолученияДанных) Экспорт
	
КонецПроцедуры

Процедура РазмерБлокаОтправкиДанных(РазмерБлокаОтправкиДанных) Экспорт
	
КонецПроцедуры

Процедура ОшибкаПриПолученииДанных(Ответ) Экспорт
	
	ОбщегоНазначенияБТС.ЗаписьТехнологическогоЖурнала("ПолучениеДанных.Ошибка", Новый Структура("КодСостояния, Описание", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку()));
	
КонецПроцедуры

Процедура ОшибкаПриОтправкеДанных(Ответ) Экспорт
	
	ОбщегоНазначенияБТС.ЗаписьТехнологическогоЖурнала("ОтправкаДанных.Ошибка", Новый Структура("КодСостояния, Описание", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку()));
	
КонецПроцедуры

Процедура ПриПолученииИмениВременногоФайла(ИмяВременногоФайла, Расширение) Экспорт
	
КонецПроцедуры

Процедура ПриПродленииДействияВременногоИдентификатора(Идентификатор, Дата, Запрос) Экспорт

КонецПроцедуры

#КонецОбласти