////////////////////////////////////////////////////////////////////////////////
// Подсистема "Менеджер сервиса криптографии".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Создает ключевую пару и формирует данные для запроса на сертификат
//
// Параметры:
//   ОповещениеОЗавершении - ОписаниеОповещения - описание процедуры, принимающей результат.
//     Результат - Структура - результат выполнения процедуры.
//       * Выполнено      		- Булево - если Истина, то процедура успешно выполнена и получен результат, иначе см. ИнформацияОбОшибке.
//       * ОписаниеОшибки 		- ИнформацияОбОшибке - описание ошибки выполнения, в случае возникновения ошибки, 
//								  нижеописанные поля не формируются
//       * ЗапросСертификата 	- ДвоичныеДанные - файлов в формате PKCS10
//       * ОткрытыйКлюч 		- ДвоичныеДанные
//       * ИмяПровайдера 		- Строка - содержит имя провайдера использованный для генерации ключа
//       * ТипПровайдера 		- Число - тип провайдера использованный для генерации ключа
//  
//   ИдентификатоЗаявления 		- Строка (36) - обычно уникальный идентификатор, используется для последующей установки сертификата
//   СодержаниеЗапроса 			- Строка - описание полей для запроса на сертификат
//   ИдентификаторАбонента 		- Строка (36) - уникальный идентификатор
//   НотариусАдвокатГлаваКФХ	- Булево - используется при формировании ОГРН
//
Процедура СоздатьКонтейнерИЗапросНаСертификат(ОповещениеОЗавершении, 
										ИдентификаторЗаявления, 
										СодержаниеЗапроса, 
										ИдентификаторАбонента = Неопределено,
										НотариусАдвокатГлаваКФХ = Ложь) Экспорт
	
	МенеджерСервисаКриптографииСлужебныйКлиент.СоздатьКонтейнерИЗапросНаСертификат(
			ОповещениеОЗавершении,
			ИдентификаторЗаявления,
			СодержаниеЗапроса,
			ИдентификаторАбонента,
			НотариусАдвокатГлаваКФХ);
	
КонецПроцедуры

// Устанавливает сертификат в защищенном хранилище
//
// Параметры:
//   ОповещениеОЗавершении - ОписаниеОповещения - описание процедуры, принимающей результат.
//     Результат - Структура - результат выполнения процедуры.
//       * Выполнено      		- Булево - если Истина, то процедура успешно выполнена и получен результат, иначе см. ИнформацияОбОшибке.
//       * ОписаниеОшибки 		- ИнформацияОбОшибке - описание ошибки выполнения, в случае возникновения ошибки, 
//  
//   ИдентификатоЗаявления 		- Строка (36) - обычно уникальный идентификатор, используется сопоставления закрытого ключа
//   ДанныеСертификата 			- ДвоичныеДанные - в кодировке DER или PEM
//
Функция УстановитьСертификатВКонтейнерИХранилище(ОповещениеОЗавершении, 
												ИдентификаторЗаявления, 
												ДанныеСертификата) Экспорт
	
	МенеджерСервисаКриптографииСлужебныйКлиент.УстановитьСертификатВКонтейнерИХранилище(
			ОповещениеОЗавершении,
			ИдентификаторЗаявления,
			ДанныеСертификата);
		
КонецФункции

#КонецОбласти