// @strict-types
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСписокИдентификаторовТестов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОбновитьДанныеФормы(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	Элементы.Объекты.Обновить();
	Элементы.ЗаписиРегистров.Обновить();
	ОбновитьСписокИдентификаторовТестов();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьСписокИдентификаторовТестов()

	ИдентификаторыТестов.Очистить();
	ИдентификаторыМассив = АвтоТестированиеСервер.ИдентификаторыВыполненныхТестов();
	ИдентификаторыТестов.ЗагрузитьЗначения(ИдентификаторыМассив);
	
	Элементы.ИдентификаторТеста.СписокВыбора.Очистить();
	Элементы.ИдентификаторТеста.СписокВыбора.ЗагрузитьЗначения(ИдентификаторыМассив);
КонецПроцедуры
#КонецОбласти
