///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Справочники._ДемоНоменклатура);
	
	// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов
	Элементы.ФормаИзменитьВыделенные.Видимость = МожноРедактировать;
	Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = МожноРедактировать;
	// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов
	
	// СтандартныеПодсистемы.ПоискИУдалениеДублей
	Элементы.ФормаОбъединитьВыделенные.Видимость = МожноРедактировать;
	Элементы.СписокКонтекстноеМенюОбъединитьВыделенные.Видимость = МожноРедактировать;
	Элементы.ФормаЗаменитьИУдалить.Видимость = МожноРедактировать;
	Элементы.СписокКонтекстноеМенюЗаменитьИУдалить.Видимость = МожноРедактировать;
	Элементы.ФормаПоказатьМестаИспользования.Видимость = МожноРедактировать;
	// Конец СтандартныеПодсистемы.ПоискИУдалениеДублей
	
	// СтандартныеПодсистемы.КонтрольВеденияУчета
	КонтрольВеденияУчета.ПриСозданииНаСервереФормыСписка(ЭтотОбъект, "Список");
	// Конец СтандартныеПодсистемы.КонтрольВеденияУчета
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
// СтандартныеПодсистемы.ОценкаПроизводительности

	КлючеваяОперация = "_ДемоОткрытиеФормыЭлемента";
	ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	
	КлючеваяОперация = "_ДемоОткрытиеФормыЭлементаТехнологическая";
	Для Индекс = СтрДлина(КлючеваяОперация) По 998 Цикл
		КлючеваяОперация = КлючеваяОперация + "_";
	КонецЦикла;
	КлючеваяОперация = КлючеваяОперация + "☺";
	ОценкаПроизводительностиКлиент.НачатьЗамерВремениТехнологический(Истина, КлючеваяОперация);
		
	КлючеваяОперация = "_ДемоОткрытиеФормыЭлементаПроизвольныйКомментарий";
	УИДЗамераСКомментарием = ОценкаПроизводительностиКлиент.ЗамерВремени(КлючеваяОперация);
	Комментарий = НСтр("ru = 'Демо: Произвольный комментарий'");
	ОценкаПроизводительностиКлиент.УстановитьКомментарийЗамера(УИДЗамераСКомментарием, Комментарий);
	
// Конец СтандартныеПодсистемы.ОценкаПроизводительности

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// СтандартныеПодсистемы.КонтрольВеденияУчета
	КонтрольВеденияУчета.ПриПолученииДанныхНаСервере(Настройки, Строки);
	// Конец СтандартныеПодсистемы.КонтрольВеденияУчета
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов

// СтандартныеПодсистемы.КонтрольВеденияУчета

&НаКлиенте
Процедура Подключаемый_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КонтрольВеденияУчетаКлиент.ОткрытьОтчетПоПроблемамИзСписка(ЭтотОбъект, "Список", Поле, СтандартнаяОбработка);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.КонтрольВеденияУчета

// СтандартныеПодсистемы.ПоискИУдалениеДублей

&НаКлиенте
Процедура ОбъединитьВыделенные(Команда)
	
	ПоискИУдалениеДублейКлиент.ОбъединитьВыделенные(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьМестаИспользования(Команда)
	
	ПоискИУдалениеДублейКлиент.ПоказатьМестаИспользования(Элементы.Список);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаменитьИУдалить(Команда)
    
    
    // СтандартныеПодсистемы.ОценкаПроизводительности
    ЦентрМониторингаКлиент.ЗаписатьОперациюБизнесСтатистики("_ДемоИнформацияКлиента._ДемоНоменклатура.ЗаменитьИУдалить.Нажатие", 1);
    // Конец СтандартныеПодсистемы.ОценкаПроизводительности
    
	ПоискИУдалениеДублейКлиент.ЗаменитьВыделенные(Элементы.Список);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПоискИУдалениеДублей

#КонецОбласти
