///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2020, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Выполняет обработку тела сообщения из канала в соответствии с алгоритмом текущего канала сообщений.
//
// Параметры:
//	КаналСообщений - Строка - идентификатор канала сообщений, из которого получено сообщение.
//	ТелоСообщения - Произвольный - тело сообщения, полученное из канала, которое подлежит обработке.
//	Отправитель - ПланОбменаСсылка.ОбменСообщениями - конечная точка, которая является отправителем сообщения.
//
Процедура ОбработатьСообщение(КаналСообщений, ТелоСообщения, Отправитель) Экспорт
	
	Если КаналСообщений = "ОбщиеСообщения\ТекстовыеСообщения" Тогда
		
		ОбщегоНазначения.СообщитьПользователю(ТелоСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
