
#Область ПрограммныйИнтерфейс
    
#Область КодыВозврата

// Возвращает код ошибки данных.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода. 
//
Функция КодВозвратаОшибкаДанных() Экспорт
	
	Возврат 10400;
    
КонецФункции

// Возвращает код внутренней ошибки.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода. 
//
Функция КодВозвратаВнутренняяОшибка() Экспорт
	
	Возврат 10500;
    
КонецФункции

//  Возвращает код выполнения с предупреждениями.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода. 
//
Функция КодВозвратаВыполненоСПредупреждениями() Экспорт
	
	Возврат 10240;
    
КонецФункции
    
// Возвращает код успешного выполнения.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода. 
//
Функция КодВозвратаВыполнено() Экспорт
	
	Возврат 10200;
	
КонецФункции

// Возвращает код отсутствия данных.
// 
// Возвращаемое значение:
//   Число - стандартный код возврата по имени метода. 
//
Функция КодВозвратаНеНайдено() Экспорт
	
	Возврат 10404;
	
КонецФункции

#КонецОбласти 

#КонецОбласти 

#Область СлужебныйПрограммныйИнтерфейс

Функция ИмяФайлаМанифеста() Экспорт
	
	Возврат "manifest.json";
	
КонецФункции

Функция ИмяПоляСоставаДанных() Экспорт
	
	Возврат "upload";
	
КонецФункции

#Область КомандыИнтерфейса

Функция КомандаВыполнить() Экспорт
	
    Возврат "execute";	
	
КонецФункции
 
Функция КомандаПолучить() Экспорт
    
    Возврат "get";
    
КонецФункции

Функция КомандаПодтвердить() Экспорт
    
    Возврат "confirm";
    
КонецФункции

Функция КомандаОтправить() Экспорт
	
	Возврат "post";
	
КонецФункции

Функция КомандаУстановить() Экспорт
	
    Возврат "setup";	
	
КонецФункции

#КонецОбласти

#Область ПоляДанных

Функция ПолеРезультат() Экспорт
	
	Возврат "result";
	
КонецФункции
 
Функция ПолеФайл() Экспорт
	
    Возврат "file";	
	
КонецФункции

Функция ПолеВерсия() Экспорт
	
    Возврат "version";	
	
КонецФункции

Функция ПолеОбработчик() Экспорт
	
    Возврат "handler";	
	
КонецФункции

Функция ПолеКодВозврата() Экспорт
	
	Возврат "response";
	
КонецФункции

Функция ПолеОшибка() Экспорт
	
	Возврат "error";
	
КонецФункции

Функция ПолеСообщениеОбОшибке() Экспорт
	
	Возврат "message";
	
КонецФункции

Функция ПолеХранилище() Экспорт
	
	Возврат "storage";
	
КонецФункции

Функция ПолеИдентификатор() Экспорт
	
	Возврат "id";
	
КонецФункции

Функция ПолеОсновнойРаздел() Экспорт
	
	Возврат "general";
	
КонецФункции
 
#КонецОбласти 

Функция КорневоеСобытие() Экспорт
	
	Возврат НСтр("ru = 'Интеграция объектов областей данных'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Функция ОповещенияОбИзмененияхНеИспользуются() Экспорт
	
	Возврат НСтр("ru = 'Оповещения об изменениях не используются'");
	
КонецФункции

Функция ОповещениеОбИзменении() Экспорт
	
	Возврат НСтр("ru = 'Оповещение об изменении'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Функция НеУдалосьОтправитьОповещение() Экспорт
	
	Возврат НСтр("ru = 'Не удалось отправить оповещение по причине: %1'", ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

Функция ДанныеОбъектаНеУстановлены() Экспорт
	
	Возврат НСтр("ru = 'Данные объекта ''%1'' не установлены.'");
	
КонецФункции

Функция ОшибкаРазбораПодтверждения() Экспорт
	
	Возврат НСтр("ru = 'Ошибка разбора подтверждения по причине: %1'");
	
КонецФункции

Функция ДанныеОперацииНеЗаданы() Экспорт
	
	НСтр("ru = 'Не заданы данные операции.'") 
	
КонецФункции
 
Функция ПустоеПодтверждение() Экспорт
	
	Возврат НСтр("ru = 'Пустое подтверждение.'");
	
КонецФункции

Функция МетодНеПоддерживается() Экспорт
	
	Возврат НСтр("ru = 'Метод не поддерживается.'");
	
КонецФункции

Функция НастройкиНеЗаданы() Экспорт
	
	Возврат НСтр("ru = 'Настройки не заданы.'");
	
КонецФункции

Функция СвойствоНеЗадано() Экспорт
    
    Возврат НСтр("ru = 'Не задано обязательное свойство ''%1'''");
    
КонецФункции
    
Функция ФайлНеНайден() Экспорт
	
	Возврат НСтр("ru = 'Не найден файл ''%1'''");
	
КонецФункции

Функция ФайлПоврежден() Экспорт
	
    Возврат НСтр("ru = 'Файл поврежден.'");
	
КонецФункции

Функция МанифестНеЗадан() Экспорт
	
	Возврат НСтр("ru = 'Не задан манифест.'");
	
КонецФункции

Функция МанифестНеВерногоФормата() Экспорт
	
	Возврат НСтр("ru = 'Манифест не верного формата. Ожидается файл в формате json.'");
	
КонецФункции

Функция ОтсутствуетСвойствоМанифеста() Экспорт 
	
	Возврат НСтр("ru = 'Отсутствует свойство манифеста ''%1'''");
	
КонецФункции

Функция ОтсутствуетСвойство() Экспорт
	
	Возврат НСтр("ru = 'Отсутствует свойство ''%1''.'");
	
КонецФункции

Функция НеОпределенаУчетнаяСистемаПоТипу() Экспорт
    
    Возврат НСтр("ru = 'Не определена учетная система по типу ''%1''.'"); 
	
КонецФункции

Функция ПереданРезультатНекорректногоТипа() Экспорт 
	
	Возврат НСтр("ru = 'Передан результат некорректного типа. Ожидается: ''%1'', получено: ''%2'''");
	
КонецФункции

Функция ПоддерживаютсяТипы() Экспорт
	
	Возврат НСтр("ru = 'Поддерживаются типы: Справочник, Документ, ПланВидовХарактеристик.'");
	
КонецФункции
    
Функция Настройки() Экспорт
	
	Возврат НСтр("ru = 'Настройки'");
	
КонецФункции

#КонецОбласти  

