////////////////////////////////////////////////////////////////////////////////
// Подсистема "Хранилище сертификатов (служебный)".
//  
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныйПрограммныйИнтерфейс

Процедура Добавить(Сертификат, ТипХранилища) Экспорт

	ХранилищеСертификатов.Добавить(Сертификат, ТипХранилища);
	
КонецПроцедуры

Функция Получить(ТипХранилища = Неопределено) Экспорт
	
	Возврат ХранилищеСертификатов.Получить(ТипХранилища);
	
КонецФункции

Функция НайтиСертификат(Сертификат) Экспорт
	
	Возврат ХранилищеСертификатов.НайтиСертификат(Сертификат);
	
КонецФункции

#КонецОбласти