//@strict-types
#Область СлужебныйПрограммныйИнтерфейс
// Проверяет, что объект входит в БСП или одну из ее подсистем.
// Параметры:
//  ПолноеИмяМетаданных - Строка - Полное имя метаданных проверяемого объекта
// 
// Возвращаемое значение:
//  Булево - Исключить регистр для тестирования по подсистеме
Функция ОбъектВходитВБСП(ПолноеИмяМетаданных) Экспорт
	
	
	МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ПолноеИмяМетаданных);
	
	ВходитВБСП = Ложь;
	ПодсистемыБСП = ПодсистемыВходящиеВСтандартные();
	Для Каждого Подсистема Из ПодсистемыБСП Цикл
		Если Подсистема.Состав.Содержит(МетаданныеОбъекта) Тогда
			ВходитВБСП = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ВходитВБСП;
КонецФункции

// Подсистемы, входящие в БСП. Если подсистема есть в возвращаемом результате - значит она входит в БСП.
// 
// Возвращаемое значение:
//  Массив из ОбъектМетаданныхПодсистема - Подсистемы входящие в стандартные
Функция ПодсистемыВходящиеВСтандартные()
	СписокПодсистемБСП = Новый Массив;
	ПодсистемаБСП = Метаданные.Подсистемы.СтандартныеПодсистемы;

	СписокПодсистемБСП.Добавить(ПодсистемаБСП);
	ДополнитьСписокПодсистемПодчиненными(СписокПодсистемБСП, ПодсистемаБСП);
	
	Возврат СписокПодсистемБСП;
КонецФункции

// Дополнить список подсистем подчиненными.
// 
// Параметры:
//  СписокПодсистем - Массив - Дополняемый список подсистем
//  РодительскаяПодсистема - ОбъектМетаданныхПодсистема -  Родительская подсистема
Процедура ДополнитьСписокПодсистемПодчиненными(СписокПодсистем, РодительскаяПодсистема)
	Для Каждого ПодчиненнаяПодсистема Из РодительскаяПодсистема.Подсистемы Цикл
		СписокПодсистем.Добавить(ПодчиненнаяПодсистема);
		ДополнитьСписокПодсистемПодчиненными(СписокПодсистем, ПодчиненнаяПодсистема)
	КонецЦикла;
КонецПроцедуры
#КонецОбласти