#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьСостояние(ДанныеЗаписи) Экспорт
    
    Менеджер = СоздатьМенеджерЗаписи();
    ЗаполнитьЗначенияСвойств(Менеджер, ДанныеЗаписи);
    Менеджер.Записать();
    
КонецПроцедуры


// Возвращает структуру записи регистра для добавления новой записи.
// 
// Возвращаемое значение:
// 	Структура - Описание:
//	 * ИдентификаторОбъекта - Строка
//	 * УчетнаяСистема - см. ОпределяемыйТип.УчетныеСистемыИнтеграцииОбластейДанных 
//	 * Состояние - ПеречислениеСсылка.СостоянияИнтеграцииОбъектов
//	 * Описание - Строка 
Функция НовыйДанныеЗаписи() Экспорт
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.СостоянияИнтеграцииОбъектов;
    ДанныеЗаписи = Новый Структура;
    Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
    	ДанныеЗаписи.Вставить(Измерение.Имя, Измерение.Тип.ПривестиЗначение(Неопределено));
    КонецЦикла;
    Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
    	ДанныеЗаписи.Вставить(Ресурс.Имя, Ресурс.Тип.ПривестиЗначение(Неопределено));
    КонецЦикла;
    
    Возврат ДанныеЗаписи;
	
КонецФункции

#КонецОбласти

#КонецЕсли
