
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
    
    Если ТипЗнч(ПараметрКоманды) = Тип("Строка") Тогда
        Отбор = Новый Структура("ИдентификаторОбъекта", ПараметрКоманды);
    Иначе
        Отбор = Новый Структура("УчетнаяСистема", ПараметрКоманды);
    КонецЕсли;
    
    ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму(
		"РегистрСведений.СостоянияИнтеграцииОбъектов.Форма.ФормаСписка",
		ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, 
		ПараметрыВыполненияКоманды.Уникальность, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
        
КонецПроцедуры
    
#КонецОбласти 
