
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ФайлТестов = ВАИНТ_ТестированиеКлиентСервер.ФайлТекущихПриемочныхТестов();
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("КаталогПроекта", ВАИНТ_ТестированиеКлиентСервер.БазовыйКаталогТестирования());
	
	ФормаОбработкиТестирования = ОткрытьФорму("Обработка.VanessaAutomationsingle.Форма.УправляемаяФорма", ПараметрыФормы);
	ФормаОбработкиТестирования.Объект.КаталогФич = ФайлТестов;
	ФормаОбработкиТестирования.ЗагрузитьФичи();
КонецПроцедуры