#Область СлужебныйПрограммныйИнтерфейс

Функция МенеджерыЛогическихХранилищ() Экспорт
	
	ВсеМенеджерыЛогическихХранилищ = Новый Соответствие;
	
	ПередачаДанныхВстраивание.МенеджерыЛогическихХранилищ(ВсеМенеджерыЛогическихХранилищ);
	ПередачаДанныхПереопределяемый.МенеджерыЛогическихХранилищ(ВсеМенеджерыЛогическихХранилищ);
	
	Возврат Новый ФиксированноеСоответствие(ВсеМенеджерыЛогическихХранилищ);
	
КонецФункции

Функция МенеджерыФизическихХранилищ() Экспорт
	
	ВсеМенеджерыФизическихХранилищ = Новый Соответствие;
	
	ПередачаДанныхВстраивание.МенеджерыФизическихХранилищ(ВсеМенеджерыФизическихХранилищ);
	ПередачаДанныхПереопределяемый.МенеджерыФизическихХранилищ(ВсеМенеджерыФизическихХранилищ);
	
	Возврат Новый ФиксированноеСоответствие(ВсеМенеджерыФизическихХранилищ);
	
КонецФункции

#КонецОбласти