////////////////////////////////////////////////////////////////////////////////
// Подсистема "ЦентрКонтроляКачества".
//
////////////////////////////////////////////////////////////////////////////////


#Область ПрограммныйИнтерфейс

// Процедура дополняет список типов инцидентов СписокТипов
//
// Параметры:
//  СписокТипов	 - Соответствие - Ключ: строка(100) с именем типа, Значение: структура со строковыми полями
//		УровеньИнцидента, Подсистема, Теги, ПроцедураПроверки.
// Пример: Здесь следует определить прикладные типы инцидентов и методы их проверки актуальности. Подробно см:
//
// 	Описание = ИнцидентыЦККСервер.СоздатьОписаниеТипаИнцидента("ОстановиласьОчередьОбменаССайтом");
// 	ИнцидентыЦККСервер.СоздатьЗаписьТипа(СписокТипов, Описание);
//
Процедура СписокТиповИнцидентовПереопределяемый(СписокТипов) Экспорт
	
КонецПроцедуры


// В процедуре можно вызвать все прикладные проверки, связанные с периодическим мониторингом прикладной конфигурации.
// Процедура вызывается с помощью регламентной процедуры МониторингЦКК раз в минуту, если константа АдресЦКК заполнена.
Процедура ВыполнитьЗадачиМониторингаЦКК() Экспорт
	
КонецПроцедуры

#КонецОбласти

