
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("ДанныеЗаполнения") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ДанныеЗаполнения = Параметры.ДанныеЗаполнения;
	
	
	Отзыв = ДанныеЗаполнения.Отзыв;
	Оценка = ДанныеЗаполнения.Оценка;
	ДатаРедактирования = ДанныеЗаполнения.ДатаРедактирования;
	Версия = ДанныеЗаполнения.Версия;
	Автор = ДанныеЗаполнения.Автор;
	Наименование = ДанныеЗаполнения.Наименование;
	
	Элементы.Версия.Видимость = ЗначениеЗаполнено(Версия);	
	Заголовок = СтрШаблон(НСтр("ru = 'Автор: %1 от %2'"), Автор, Формат(ДатаРедактирования, "ДЛФ=DD"));
	
	ОтобразитьИнформациюОбОценке();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтобразитьИнформациюОбОценке()
	
	Оценка_1 = ?(Оценка >= 1, 0, 2); 
	Оценка_2 = ?(Оценка >= 2, 0, 2); 
	Оценка_3 = ?(Оценка >= 3, 0, 2); 
	Оценка_4 = ?(Оценка >= 4, 0, 2); 
	Оценка_5 = ?(Оценка >= 5, 0, 2);
	
	Если Оценка = 1 Тогда
		ОписаниеПоказателя = НСтр("ru = 'Ужасно'");
		Цвет = Новый Цвет(191, 55, 1);
	ИначеЕсли Оценка = 2 Тогда
		ОписаниеПоказателя = НСтр("ru = 'Плохо'");
		Цвет = Новый Цвет(255, 99, 72);
	ИначеЕсли Оценка = 3 Тогда
		ОписаниеПоказателя = НСтр("ru = 'Нормально'");
		Цвет = Новый Цвет(255, 165, 0);
	ИначеЕсли Оценка = 4 Тогда
		ОписаниеПоказателя = НСтр("ru = 'Хорошо'");
		Цвет = Новый Цвет(28, 116, 28);
	ИначеЕсли Оценка = 5 Тогда
		ОписаниеПоказателя = НСтр("ru = 'Отлично'");
		Цвет = Новый Цвет(50, 205, 50);
	Иначе
		ОписаниеПоказателя = "";
		Цвет = Новый Цвет(51, 51, 51);
	КонецЕсли;
	
	Элементы.Показатель.Заголовок = ОписаниеПоказателя;
	Элементы.Показатель.ЦветТекста = Цвет;
	
КонецПроцедуры

#КонецОбласти







