#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс
	
Функция РегламентноеЗадание(ДополнительныеОбработчики) Экспорт
	
	Идентификатор = Строка(ДополнительныеОбработчики.УникальныйИдентификатор());
	
	Отбор = Новый Структура("Метаданные, Ключ", Метаданные.РегламентныеЗадания.ОбработкаОчередиЗаданийБТС, Идентификатор);
	НайденныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	Если НайденныеЗадания.Количество() Тогда
		Возврат НайденныеЗадания[0];
	КонецЕсли;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
