#Область ОписаниеПеременных
// В переменную сохраняется форма обработки Vanessa Automation при начале ее открытия.
Перем глоФормаОбработкиВА Экспорт;
// В переменную сохраняется количество прошедших проверок открытия формы ВА в обработчике ожидания открытия.
Перем глоКоличествоПроверокОткрытияФормыВА Экспорт;
// В переменную сохраняется путь к файлу тестов, который должен выполниться, если тестирование запущено командой из формы элемента объекта.
Перем  глоФайлТестовКомандыТестирования Экспорт; // Строка -
#КонецОбласти