#Область ПрограммныйИнтерфейс

// Позволяет дополнить, изменить данные перед отправкой в менеджер сервиса.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  ИдентификаторПравила - Строка - идентификатор правила. 
//  Данные - Структура - данные к отправке. 
//
Процедура ОбработатьДанныеПередОтправкой(ИдентификаторПравила, Данные) Экспорт
КонецПроцедуры

// Процедура обработки оповещения об изменении объекта. 
// Вызывается после получения данных объекта, перед сохранением объекта в безопасное хранилище.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  ИдентификаторПравила - Строка - идентификатор правила.
//  КлючОбъекта - Строка - ключ объекта. 
//  Данные - Структура - данные объекта.
//
Процедура ОбработатьОповещениеОбИзменении(ИдентификаторПравила, КлючОбъекта, Данные) Экспорт
КонецПроцедуры
 
#КонецОбласти 
