#Область ПрограммныйИнтерфейс

// Регистрирует тарифицируемые услуги конфигурации из Структуры.
//
// Параметры:
//  ПоставщикиУслуг - Массив - массив структур, описывающей поставщика услуги:
//   * Идентификатор - Строка - идентификатор поставщика услуги (тип Строка - Строка(50)),
//   * Наименование - Строка - наименование поставщика услуги (тип Строка - Строка(150)),
//   * Услуги - Массив - массив услуг, массив структур с обязательными ключами:
//   	** Идентификатор - Строка - идентификатор услуги  (тип Строка - Строка(50))
//      ** Наименование - Строка - наименование услуги  (тип Строка - Строка(150))
//      ** ТипУслуги - ПеречислениеСсылка.ТипыУслуг - тип услуги.
//
Процедура ПриФормированииСпискаУслуг(ПоставщикиУслуг) Экспорт
	
КонецПроцедуры

// Событие, которое вызывается при изменении активации лицензии.
//
// Параметры:
//  ДанныеОЛицензии - Структура - данные о лицензии.
//    ** Услуга - СправочникСсылка.Услуги - услуга.
//    ** ИмяЛицензии - Строка - имя лицензии.
//    ** КонтекстЛицензии - Строка - контекст лицензии.
//  ЛицензияАктивирована - Булево - активирована лицензия или деактивирована.
//
Процедура ПриИзмененииСостоянияАктивацииЛицензии(ДанныеОЛицензии, ЛицензияАктивирована) Экспорт
       
КонецПроцедуры

// Событие, которое вызывается при обновлении доступных лицензий.
//
// Параметры:
//	ПараметрыЛицензии - Структура - структура лицензии. 
//	 Структура соответствует составу реквизитов, измерений и ресурсов РС "ДоступныеЛицензии".
//
Процедура ПриОбновленииДоступныхЛицензий(ПараметрыЛицензии) Экспорт
     
КонецПроцедуры

// Событие, которое вызывается при удалении доступных лицензий.
//
// Параметры:
//	ПараметрыЛицензии - Структура - структура лицензии. 
//	 Структура соответствует составу реквизитов, измерений и ресурсов РС "ДоступныеЛицензии".
//
Процедура ПриУдаленииДоступныхЛицензий(ПараметрыЛицензии) Экспорт
   
КонецПроцедуры

// Вызывается при определении представления валюты оплаты сервиса.
// 
// Параметры:
//  ПредставлениеВалютыОплаты - Строка - представление валюты оплаты.
//
Процедура ПриУстановкеПредставленияВалютыОплаты(ПредставлениеВалютыОплаты) Экспорт
	
КонецПроцедуры

// Вызывается при получении имени формы обработки ответа на запрос счета на оплату.
// 
// Параметры:
//  ИмяФормыОбработкиОтвета - Строка - имя формы обработки ответа.
//
Процедура ПриПолученииИмениФормыОбработкиОтвета(ИмяФормыОбработкиОтвета) Экспорт
	
КонецПроцедуры

#КонецОбласти
